Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииОбъектов", Истина);
	
	Настройки.ПорядокВыполнения = 1000000;
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииОбъектов(Форма, Отказ, МассивОписаний) Экспорт
		Если НЕ РольДоступна("А1И_Инструменты") Тогда Возврат Неопределено; КонецЕсли;
		Если А1Э_Метаданные.ТипМетаданных(Форма.ИмяФормы) = "Обработка" Тогда Возврат Неопределено; КонецЕсли;
		Если НЕ А1Э_Общее.РавноОдномуИз(А1Э_Формы.ТипФормы(Форма), "ФормаЭлемента", "ФормаСписка") Тогда Возврат Неопределено; КонецЕсли; 
		
		А1Э_Формы.ДобавитьОписаниеГруппы(МассивОписаний, "А1И_РедактированиеОбъектов_Подменю", "(А1И) Редактор", А1Э_Формы.КоманднаяПанель(Форма), , А1Э_Структуры.Создать(
		"Вид", ВидГруппыФормы.Подменю,
		));
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "А1И_РедактированиеОбъектов_ОткрытьОбъект", ИмяМодуля() + ".РедакторОбъекта__КомандаОткрыть", "Открыть объект",  "А1И_РедактированиеОбъектов_Подменю"); 	
		Если А1Э_Метаданные.ТипМетаданных(Форма.ИмяФормы) = "Документ" Тогда
			А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "А1И_РедактированиеОбъектов_ОткрытьДвижения", ИмяМодуля() + ".РедакторДвижений__КомандаОткрыть", "Открыть движения",  "А1И_РедактированиеОбъектов_Подменю");
		КонецЕсли;	
	КонецФункции
	
#КонецЕсли

#Область РедакторОбъекта
#Если НЕ Клиент Тогда
	
	Функция РедакторОбъекта__УниверсальнаяФормаОбъектаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		Ссылка = Форма.Параметры.Ссылка;
		Объект = Ссылка.ПолучитьОбъект();
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, "Объект", ТипЗнч(Объект));
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
		МассивОписаний.Очистить();
		А1БК_СтандартнаяФорма.ФормаЭлементаПриСозданииОбъектов(Форма, Отказ, МассивОписаний);
		
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "СохранитьИзменения", ИмяМодуля() + ".Редактор__СохранитьИзменения:НаСервере", "Сохранить изменения", "ФормаКоманднаяПанель"); 
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
		
		Форма.ЗначениеВРеквизитФормы(Объект, "Объект");
		
		//Поскольку стандартное отображение поля проведен приводит к заблокированному флажку, то рисуем свое поле.
		Если Форма.Элементы.Найти("Проведен") <> Неопределено Тогда
			МассивОписаний = Новый Массив;
			Форма.Элементы.Проведен.Видимость = Ложь;
			А1Э_Формы.ДобавитьОписаниеРеквизитаИЭлемента(МассивОписаний, "Проведен", "Булево", , , , "Проведен", А1Э_Структуры.Создать(
			"ИмяЭлемента", "ПроведенНаФорме",
			));
			А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
			Форма.Проведен = Объект.Проведен;
		КонецЕсли;
		
		Форма.Заголовок = "(А1И: Редактор)" + Ссылка;
	КонецФункции
	
	Функция РедакторДвижений__СохранитьИзменения(Форма, ИмяКоманды) Экспорт 
		Объект = Форма.РеквизитФормыВЗначение("Объект");
		
		Если Форма.Элементы.Найти("Проведен") <> Неопределено Тогда
			Если Объект.ПометкаУдаления Тогда 
				Объект.Проведен = Ложь;
			Иначе
				Объект.Проведен = Форма.Проведен;
			КонецЕсли;
		КонецЕсли;
		А1Э_Объекты.Записать(Объект);
		Форма.ЗначениеВРеквизитФормы(Объект, "Объект");
		Если Форма.Элементы.Найти("Проведен") <> Неопределено Тогда
			Форма.Проведен = Объект.Проведен;
		КонецЕсли;
	КонецФункции
	
#КонецЕсли
#Если Клиент Тогда
	
	Функция РедакторОбъекта__КомандаОткрыть(Форма, Команда) Экспорт 
		ТекущаяСсылка = А1Э_Формы.ТекущаяСсылка(Форма);
		Если НЕ ЗначениеЗаполнено(ТекущаяСсылка) Тогда
			Сообщить("Текущая ссылка не обнаружена!");
		КонецЕсли;
		А1Э_УниверсальнаяФорма.Открыть("Редактор", ИмяМодуля() + ".РедакторОбъекта__УниверсальнаяФормаОбъектаПриСозданииНаСервере", А1Э_Структуры.Создать(
		"Ссылка", ТекущаяСсылка,
		)); 	
	КонецФункции
	
#КонецЕсли
#КонецОбласти

#Область РедакторДвижений
#Если НЕ Клиент Тогда
	
	Функция РедакторДвижений__УниверсальнаяФормаОбъектаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
		Ссылка = Форма.Параметры.Ссылка;
		Объект = Ссылка.ПолучитьОбъект();
		МетаданныеОбъекта = Ссылка.Метаданные();
		МассивОписаний = Новый Массив;
		А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, "Объект", ТипЗнч(Объект));	
		А1Э_Формы.ДобавитьОписаниеГруппыСтраниц(МассивОписаний, "СтраницыДвижений");
		Движения = МетаданныеОбъекта.Движения;
		Для Каждого МетаданныеРегистра Из Движения Цикл
			ИмяМетаданных = МетаданныеРегистра.ПолноеИмя();
			ТипМетаданных = А1Э_Метаданные.ТипМетаданных(МетаданныеРегистра);
			//ТУДУ: реализовать для регистра бухгалтерии.
			Если НЕ А1Э_Общее.РавноОдномуИз(ТипМетаданных, "РегистрСведений", "РегистрНакопления") Тогда Продолжить; КонецЕсли;
			Ключ = СтрЗаменить(ИмяМетаданных, ".", "___");
			А1Э_Формы.ДобавитьОписаниеСтраницы(МассивОписаний, "Страница" + Ключ, МетаданныеРегистра.Синоним, "СтраницыДвижений"); 
			А1И.А1БК_РедактируемаяТаблицаДанных().ДобавитьОписаниеСПодчинениемОбъекту(МассивОписаний, "Таблица" + Ключ, ИмяМетаданных, "Регистратор", "Страница" + Ключ, , А1Э_Структуры.Создать(
			"ОбработкаПериодичности", Ложь,
			));
		КонецЦикла;
		А1Э_УниверсальнаяФорма.ДобавитьРеквизитыИЭлементы(Форма, МассивОписаний);
		Форма.ЗначениеВРеквизитФормы(Объект, "Объект");
		
		Форма.Заголовок = "(А1И: Движения)" + Ссылка;
	КонецФункции
	
#КонецЕсли
#Если Клиент Тогда
	
	Функция РедакторДвижений__КомандаОткрыть(Форма, Команда) Экспорт 
		ТекущаяСсылка = А1Э_Формы.ТекущаяСсылка(Форма);
		Если НЕ ЗначениеЗаполнено(ТекущаяСсылка) Тогда
			Сообщить("Текущая ссылка не обнаружена!");
		КонецЕсли;
		А1Э_УниверсальнаяФорма.Открыть("Редактор", ИмяМодуля() + ".РедакторДвижений__УниверсальнаяФормаОбъектаПриСозданииНаСервере", А1Э_Структуры.Создать(
		"Ссылка", ТекущаяСсылка,
		)); 	
	КонецФункции
	
#КонецЕсли	
#КонецОбласти

Функция ИмяМодуля() Экспорт
	Возврат "А1И_РедактированиеОбъектов";	
КонецФункции