
&НаСервере
Функция ПоказатьОшибкиНаСервере()
	ТаблицаОшибок.Очистить();
	Ошибки = А1Э_Механизмы.ОшибкиМеханизмов();
	Для Каждого Пара Из Ошибки Цикл
		Механизм = Пара.Ключ;
		Для Каждого Ошибка Из Пара.Значение Цикл
			Строка = ТаблицаОшибок.Добавить();
			Строка.Механизм = Механизм;
			ЗаполнитьЗначенияСвойств(Строка, Ошибка);
		КонецЦикла;
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	ПоказатьОшибкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьОшибкиНаСервере()
	А1Э_Механизмы.ИсправитьОшибкиМеханизмов();
	ПоказатьОшибкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьОшибки(Команда)
	ИсправитьОшибкиНаСервере();
КонецПроцедуры


