Функция ОписанияПакетов() Экспорт
	Описания = Новый Массив;
	
	ДобавитьОписаниеПакета(Описания, "А1Э", "1.5.6 - 2020-08-19", "А1Э - библиотека экспортных функций для 1С",
	"https://github.com/Shadawn/A1-Export/raw/master/%D0%901%D0%AD.cfe");
	ДобавитьОписаниеПакета(Описания, "А1БК", "2020-08-14", "А1БК - библиотека компонентов для 1С",
	"https://github.com/Shadawn/A1-Export/raw/master/%D0%901%D0%AD.cfe");
	//ДобавитьОписаниеПакета()
	Возврат Описания;
КонецФункции

Функция ДобавитьОписаниеПакета(Описания, Имя, Версия, Описание, СсылкаЗагрузки, СодержитДанные = Ложь) Экспорт
	Описания.Добавить(НовыйОписаниеПакета(Имя, Версия, Описание, СсылкаЗагрузки, СодержитДанные));
КонецФункции

Функция НовыйОписаниеПакета(Имя, Версия, Описание, СсылкаЗагрузки, СодержитДанные = Ложь)
	Описание = Новый Структура;
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Версия", Версия);
	Описание.Вставить("Описание", Описание);
	Описание.Вставить("СсылкаЗагрузки", СсылкаЗагрузки);
	Описание.Вставить("СодержитДанные", СодержитДанные);
	
	Возврат Описание;
КонецФункции 

