Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииОбъектов", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииОбъектов(Форма, Отказ, МассивОписаний) Экспорт
		А1И.А1БК_ПолеВыбораФайла().ДобавитьОписание(МассивОписаний, "КаталогРасширения", "Каталог расширения", А1Э_Структуры.Создать(
		"Режим", "ВыборКаталога",
		));
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "ДобавитьМеханизмы", ИмяМодуля() + ".ДобавитьМеханизмы", "Добавить (обновить) механизмы");
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "ПоказатьКодОбработчиковФормы", ИмяМодуля() + ".ПоказатьКодОбработчиковФормы", "Показать код обработчиков формы");
	КонецФункции 
	
#КонецЕсли
#Если Клиент Тогда
	
	Функция ДобавитьМеханизмы(Форма, Команда) Экспорт 
		А1Э_Механизмы.ОбработатьРасширение(Форма.КаталогРасширения);
	КонецФункции 
	
	Функция ПоказатьКодОбработчиковФормы(Форма, Команда) Экспорт 
		А1Э_Строки.Показать(А1Э_Механизмы.ТекстОбработчиковФормы(Ложь));	
	КонецФункции
#КонецЕсли
 
Функция ИмяМодуля() Экспорт
	Возврат "А1И_ПомощникРаботыСМеханизмами";
КонецФункции 