Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1И_ПомощникКонтроляВерсий");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1И_ПомощникРаботыСМеханизмами");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1И_ПомощникРаботыСИдентификаторами");
	
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1И_Общее");
	
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1И_РедактированиеОбъектов");
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.Подключить(СписокОбъектов, "Обработка.А1И_ПомощникКонтроляВерсий", "А1И_ПомощникКонтроляВерсий");
	А1Э_Механизмы.Подключить(СписокОбъектов, "Обработка.А1И_ПомощникРаботыСМеханизмами", "А1И_ПомощникРаботыСМеханизмами");
	А1Э_Механизмы.Подключить(СписокОбъектов, "Обработка.А1И_ПомощникРаботыСИдентификаторами", "А1И_ПомощникРаботыСИдентификаторами");
	
	А1Э_Механизмы.ПодключитьБезПривязки(СписокОбъектов, "А1И_Общее");
	
	А1Э_Механизмы.ПодключитьКоВсемОбъектам(СписокОбъектов, "А1И_РедактированиеОбъектов");
КонецФункции 