#Область Импорт

Функция А1БК_СохраняемаяВНастройкахТаблица() Экспорт
	Возврат Модуль("А1БК_СохраняемаяВНастройкахТаблица");	
КонецФункции 

Функция А1БК_ПолеВыбораФайла() Экспорт
	Возврат Модуль("А1БК_ПолеВыбораФайла");
КонецФункции

Функция А1БК_СохраняемоеПоле() Экспорт
	Возврат Модуль("А1БК_СохраняемоеПоле");
КонецФункции

Функция А1БК_РедактируемаяТаблицаДанных() Экспорт
	Возврат Модуль("А1БК_РедактируемаяТаблицаДанных");	
КонецФункции

Функция Модуль(Имя)
	Возврат Вычислить(Имя);	
КонецФункции 

#КонецОбласти 