
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	А1Э_СКД.РезультатВыполненияОтчета(ЭтотОбъект, ТаблицаМеханизмов(), ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
КонецПроцедуры

Функция ТаблицаМеханизмов() Экспорт
	ВсеМеханизмы = А1Э_Механизмы.ВсеМеханизмы();
	ВсеМеханизмыСОбъектами = А1Э_Механизмы.ВсеМеханизмыСОбъектами();
	
	ТаблицаМеханизмов = Новый ТаблицаЗначений;
	ТаблицаМеханизмов.Колонки.Добавить("Механизм", А1Э_Строки.ОписаниеТипа(150));
	ТаблицаМеханизмов.Колонки.Добавить("Объект", А1Э_Строки.ОписаниеТипа(150));
	ТаблицаМеханизмов.Колонки.Добавить("Событие", А1Э_Строки.ОписаниеТипа(150));
	ТаблицаМеханизмов.Колонки.Добавить("Обработчик", А1Э_Строки.ОписаниеТипа(150));
	ТаблицаМеханизмов.Колонки.Добавить("ПорядокВыполнения", А1Э_Числа.ОписаниеТипа(10));
	
	Для Каждого МеханизмСОбъектами Из ВсеМеханизмыСОбъектами Цикл
		Механизм = МеханизмСОбъектами.Ключ;
		ДанныеМеханизма = ВсеМеханизмы[Механизм]; 
		Для Каждого ОбъектСКонтекстом Из МеханизмСОбъектами.Значение Цикл
			Для Каждого ОбработчикКлючЗначение Из ДанныеМеханизма.Обработчики Цикл
				Строка = ТаблицаМеханизмов.Добавить();
				Строка.Механизм = Механизм;
				Строка.Объект = ОбъектСКонтекстом.Ключ;
				Строка.Событие = ОбработчикКлючЗначение.Ключ;
				Строка.Обработчик = А1Э_Механизмы.ИмяФункцииОбработчика(ДанныеМеханизма, ОбработчикКлючЗначение.Ключ);
				Строка.ПорядокВыполнения = ДанныеМеханизма.ПорядокВыполнения; 
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаМеханизмов;
КонецФункции 
